app/controllers/devise/registrations_controller.rb

  def create
    build_resource(sign_up_params)
    resource.image = params[:user][:image] if params[:user][:image].present?
    resource.save
---
INSERT INTO `users` (`first_name`, `last_name`, `dob`, `shipping_address`, `billing_address`, `email`, `encrypted_password`, `confirmation_token`, `confirmation_sent_at`, `created_at`, `updated_at`) VALUES ('jyoti', 'mohapatra', '1996-08-03', '', '', 'jyotiprakashm@mindfiresolutions.com', '$2a$11$ERfOZGZfzHQaZOYELahAxOvcJsopipKK7d6QF8dYBtQf54A064Ebm', 'y8xwy3mx8J8V8Yr8YPxD', '2019-08-28 08:54:17', '2019-08-28 08:54:17', '2019-08-28 08:54:17')